### Terraform Plan: `prod/data`
```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.base: Reading...
module.database.random_password.db: Refreshing state... [id=none]
module.database.aws_ssm_parameter.db_password: Refreshing state... [id=/doktori/prod/DB_PASSWORD]
module.database.aws_db_parameter_group.main: Refreshing state... [id=doktori-prod-mysql80]
data.terraform_remote_state.base: Read complete after 2s
module.database.aws_db_subnet_group.main: Refreshing state... [id=doktori-prod-db-subnet-group]
module.database.aws_security_group.rds: Refreshing state... [id=sg-0d5648dee91a19ab3]
module.database.aws_db_instance.main: Refreshing state... [id=db-HUQJVXIC2S6O7TQTMHSE5UXRTM]
aws_route53_record.rds: Refreshing state... [id=Z04783583MC5PWNZP04CM_db.prod.doktori.internal_CNAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.database.aws_ssm_parameter.db_password must be replaced
-/+ resource "aws_ssm_parameter" "db_password" {
      ~ arn            = "arn:aws:ssm:ap-northeast-2:250857930609:parameter/doktori/prod/DB_PASSWORD" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ has_value_wo   = false -> (known after apply)
      ~ id             = "/doktori/prod/DB_PASSWORD" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "/doktori/prod/DB_PASSWORD" -> "/doktori/prod/db/password" # forces replacement
      ~ tags           = {
          + "Name" = "doktori-prod-db-password"
        }
      ~ tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-prod-db-password"
          + "Project"     = "doktori"
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ database = {
      ~ db_password_ssm_path = "/doktori/prod/DB_PASSWORD" -> "/doktori/prod/db/password"
        # (7 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```